app/serializers/story_serializer.rb

  def submissions
      subs = object.submissions
      user_id = instance_options[:user_id]


      subs = subs.sort do |a,b|
        b.tally_votes <=> a.tally_votes
      end

      subs = subs.map do |sub|
---
SELECT "submissions".* FROM "submissions" WHERE "submissions"."story_id" = $1  [["story_id", "1"]]